import sys

input = sys.stdin.read

#append
#insert
#del
#pop
#remove
#index

#dictionary

# a = list(map(int, input().split()))



# A사의 신입사원 김커피씨는 점심 시간이 끝나가면서 상사에게 커피를 사오라는 명령을 받았다. 김커피씨는 법인 카드를 최대 K원 이용할 수 있다. 

# 김커피씨가 근무중인 부서에는 N명의 사람들이 있는데, 각각 원하는 커피의 종류가 정해져 있다. 

# 스타벅스에는 M개의 커피 종류가 있고, 1 ~ M까지의 번호가 주어져 있다. 김커피씨가 주어진 돈으로 N명이 원하는 모든 커피를 구매할 수 있을지 구하는 프로그램을 작성하라.

# 입력
# 첫 줄에 테스트케이스 T가 주어진다 (T ≤ 20)
# 첫 줄에 직원 수 N(1 ≤ N ≤ 30), 커피의 종류 M(1 ≤ M ≤ 20), 법인 카드 사용 한도 K(0 ≤ K ≤ 100,000)가 차례대로 주어진다.
# 그 다음 N개의 줄에 직원들이 원하는 커피의 종류 Ci (1 ≤ Ci ≤ M) 가 주어진다. 
# 그 다음 M개의 줄에는 커피의 가격 Pi가 주어진다 (3,000 ≤ Pi ≤ 8,000)

# 출력
# 김커피씨가 모든 커피를 구매할 수 있으면 "Y"를, 모든 커피를 구매할 수 없으면 "N"를 출력한다.

#2번 반복해야되 직원수 : N 커피종류: M 한도 :K


def solve():
    n , m ,k = map(int,input().split())
    arr = []
    for i in range(n):
        arr.append(int(input()))
    cost = []
    for j in range(m):
        cost.append(int(input()))
    s = 0
    for i in range(n):
        s += cost[arr[i]-1]
    if s > k:
        print('N')
    else:
        print('Y')
tc = int(input())
for t in range(tc):
    solve()

#  데이터베이스를 구축하고 있다. 길이는 M 인 데이터는 N개가 있다.

# 데이터 탐색의 조건은 다음과 같다.

#    1. 탐색 요청 시 찾을 데이터 길이는 M이다.

#    2. 탐색시 데이터의 일부만 주어질수도 있다.

# 예를 들어 데이터 1 2 3 4 5 를 찾고자 할 때 1 2 -1 -1 5 의 형식이 가능하다. -1은 어떤 데이터가 존재 하더라도 무관하다는 뜻이다.

# 데이터가 주어져 있고 탐색을 요청하였을 때 몇 개의 데이터가 탐색되는지 알아내는 프로그램을 구현하자.

# 입력
# 첫 번째 줄에는 데이터 수 N, 데이터 길이 M이 주어진다. (1 ≤ N, M ≤ 103)

# 다음 N개의 줄에는 M개의 숫자 Aij로 이루어진, 데이터베이스의 행이 주어진다. (1 ≤ Aij ≤ 106)

# 다음 줄에는 Q가 주어진다. (1 ≤ Q ≤ 50)

# 다음 Q개의 줄에는 M개의 숫자 Bij로 이루어진, 탐색 데이터가 주어진다. (Bij = -1 또는 1 ≤ Bij ≤ 106)

# 출력
# Q개의 줄에 각 쿼리에 대한 결과를 출력한다.   

N, M = map(int,input().split())

arr = []

for _ in range(N):
    v = map(int, sys.stdin.readline().rstrip())
    arr.append(v)
    #arr = [[1,5,2],[2,3,4],[4,3,2],[5,4,6]]

Q = map(int,sys.stdin.readline().rstrip())

arr_2 = []
for t in range(Q):
    b = map(int, sys.stdin.readline().rstrip())
    arr_2.append(b)
    #arr_2 = [[-1,-1,2],[-1,3,2],[-1,-1,-1]]


# 데이터베이스를 구축하고 있다. 길이는 M 인 데이터는 N개가 있다.

# 데이터 탐색의 조건은 다음과 같다.

#    1. 탐색 요청 시 찾을 데이터 길이는 M이다.

#    2. 탐색시 데이터의 일부만 주어질수도 있다.

# 예를 들어 데이터 1 2 3 4 5 를 찾고자 할 때 1 2 -1 -1 5 의 형식이 가능하다. -1은 어떤 데이터가 존재 하더라도 무관하다는 뜻이다.

# 데이터가 주어져 있고 탐색을 요청하였을 때 몇 개의 데이터가 탐색되는지 알아내는 프로그램을 구현하자.

# 입력
# 첫 번째 줄에는 데이터 수 N, 데이터 길이 M이 주어진다. (1 ≤ N, M ≤ 103)

# 다음 N개의 줄에는 M개의 숫자 Aij로 이루어진, 데이터베이스의 행이 주어진다. (1 ≤ Aij ≤ 106)

# 다음 줄에는 Q가 주어진다. (1 ≤ Q ≤ 50)

# 다음 Q개의 줄에는 M개의 숫자 Bij로 이루어진, 탐색 데이터가 주어진다. (Bij = -1 또는 1 ≤ Bij ≤ 106)

# 출력
# Q개의 줄에 각 쿼리에 대한 결과를 출력한다.
n,m = map(int, input().split())
data = []

for i in range(N):
    s = list(map(int, input().split()))
    data.append(s)

Q = int(input())

def match(a,b):
    for i in range(m):
        if b[i] == -1:
            continue
        if b[i] != a[i]:
            return False
    return True

for i in range(Q):
    s = list(map(int, input().split()))
    ans = 0
    for d in data:
        if match(d,s):
            ans += 1
    print(ans)
        
# 티모랜드 워터파크에는 100개의 대여용 튜브가 있다. 각 튜브에는 1부터 100까지 번호표가 붙어있다.

# 티모랜드 워터파크는 6시에 완전히 영업을 종료한다.

# 워터파크 주인인 티모는 매일 오후 6시가 되면 대여해준 튜브가 모두 반납 되었는지 확인한다.

# 티모는 이 일을 매우 싫어하므로, 반납 된 튜브 번호를 입력받으면 반납되지 않은 튜브 번호를 출력하는 프로그램을 만들어 튜브 반납 확인에 사용하려고 한다.

# 우리 모두 티모가 되어 프로그램을 작성해보자.

# 입력
# 첫 줄에 반납 된 튜브의 개수 n이 주어진다.  (0 ≤ n ≤100 )

# 다음 n개의 줄에 반납 된 튜브 번호가 주어진다.

# 출력
# 반납 되지 않은 튜브의 번호를 한 줄 씩 작은 것부터 순서대로 출력한다.

# 풀이 : 100개의 리스트에 False로 채운다. 그리고 각 번호를 받고 그 번호에 해당되는 리스트 자리에 True를 채운다.
# 결과 리스트를 처음부터 100까지 돌려 False값인 리스트 숫자를 프린트하면 끝!
v = [False for i in range(101)]
n = int(input())

for i in range(n):
    t = int(input())
    v[t] = True

for i in range(1,101):
    if v[i] == False:
        print(i)


# 2차원, 배열 또는 리스트는 행렬로 표현 되기도 한다.

# 행렬 데이터가 주어졌을때 행 또는 열 정보를 출력하는 코드를 작성하시오.

 

# 1	2	3
# 4	5	6
# 7	8	9
# 10	11	12
# 13	14	15
# 행 3 : 10 11 12

# 행 0 : 1 2 3

# 열 2 : 3 6 9 12 15

# 열 0 : 1 4 7 10 13

# 입력
# 첫 줄에 세로, 가로 크기가 주어진다.( 0 < H,W ≤ 20)

# 다음 H줄 만큼 데이터가 주어진다. 모든 데이터는 100보다 작다.

# 다음 줄에 질문의 수Q가 주어진다. (0 < Q ≤ 10)

# 다음 줄부터 Q줄 동안 질문이 주어진다.

# 질문은 t v 형태로 주어지며 t가 0일때 행, t가 1일때 열을 의미하고 v는 번호를 의미한다. 행과 열을 벗어나는 질문은 주어지지 않는다.
# 7 12
# 3 13 72 30 38 79 87 91 96 83 71 35 
# 27 69 6 68 67 60 90 87 33 27 60 2 
# 63 93 40 20 74 79 48 82 15 63 8 18 
# 5 84 15 71 55 93 56 88 96 35 0 61 
# 11 58 35 27 38 15 2 50 34 4 65 73 
# 20 42 0 87 41 75 8 24 44 80 45 8 
# 76 45 53 35 48 45 76 55 84 61 47 79 
# 8
# 0 1
# 1 5
# 1 6
# 1 9
# 0 5
# 0 4
# 1 6
# 1 4

#행 : H = 7 W = 12

H, W = map(int, input().split())

data = []

for _ in range(H):
    s = list(map(int, input().split()))
    data.append(s)

Q = int(input())

for _ in range(Q):
    a, b = map(int,input().split())
    if a == 0:
        for j in range(W):
            print(data[b][j],end=' ')
        print()
    else:
        for i in range(H):
            print(data[i][b], end=' ')
        print()

